app/controllers/candidates_controller.rb

    def new
        @candidate = Candidate.new
        if session[:election_id]
            if nil !=session[:election_id]
                @election = Election.find(session[:election_id])
---
SELECT "elections".* FROM "elections" WHERE "elections"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]

    def create
        @candidate = Candidate.new(candidate_params)
        @candidate.election_id = session[:election_id]
        @candidate.score = 0
        if @candidate.save
---
INSERT INTO "candidates" ("name", "image", "score", "election_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def view

        @currentcandidates = Candidate.all.where(election_id: session[:election_id])
        @theelection = Election.all.find(@currentcandidates.first.election_id)
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."election_id" = ? ORDER BY "candidates"."id" ASC LIMIT ?  [["election_id", 2], ["LIMIT", 1]]
SELECT "elections".* FROM "elections" WHERE "elections"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def set_candidate
        @candidate = Candidate.find(params[:format])
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]