app/controllers/elections_controller.rb

    def search

        @searchterm = Election.where(["title LIKE ?","%#{params[:search]}%"])
---
SELECT "elections".* FROM "elections" WHERE "elections"."title" IN (SELECT "elections"."id" FROM "elections" WHERE (name LIKE '%Test Election%'))

    def create
        @election = Election.new(election_params)
        @election.created_by = Current.user.email
        if @election.save
---
INSERT INTO "elections" ("title", "created_by", "ispublic", "participants", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "tester2"], ["created_by", "jake@test.com"], ["ispublic", 1], ["participants", ""], ["created_at", "2021-04-07 16:25:49.613440"], ["updated_at", "2021-04-07 16:25:49.613440"]]
INSERT INTO "elections" ("title", "created_by", "ispublic", "participants", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def view

        @publicelections = Election.all.where(ispublic: true)

        @createdbyelections = Election.all.where(created_by: Current.user.email)

        @privelections = Election.all.where(ispublic: false)
        @privelections.each do |election|
            if election.participants.include? Current.user.email
---
SELECT "elections".* FROM "elections" WHERE "elections"."ispublic" IS NULL
SELECT "elections".* FROM "elections" WHERE "elections"."created_by" = ?  [["created_by", "jake@test.com"]]
SELECT "elections".* FROM "elections" WHERE "elections"."ispublic" = ?  [["ispublic", 0]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "elections" WHERE "elections"."created_by" = ? LIMIT ?  [["created_by", "jakehorner19@gmail.com"], ["LIMIT", 1]]

    def set_election
        @Election = Election.find(params[:format])
---
SELECT "elections".* FROM "elections" WHERE "elections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]