app/controllers/password_resets_controller.rb

def update
    @user = User.find_signed!(params[:token], purpose: "password_reset")
    if @user.update(password_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$FodFQXwBWafNNl7tim06EO1zjG5conq43KAxLoV/q3rTtCruBBOIG"], ["updated_at", "2021-03-30 22:15:17.518084"], ["id", 1]]